[PAD]
[UNK]
[CLS]
[SEP]

!
"
#
$
%
&
'
(
)
*
+
,
.
/
:
;
<
=
>
?
@
[
\
]
^
_
`
{
|
}
~
\
t
the
of
and
in
to
a
is
that
for
it
as
was
with
on
are
you
this
be
at
by
from
or
have
not
an
they
which
one
were
all
her
she
there
been
if
their
will
would
who
its
about
but
can
had
has
our
what
when
we
your
do
how
does
did
no
more
so
up
out
my
than
into
could
them
time
very
just
over
such
because
me
other
also
now
only
new
any
these
some
may
then
like
well
two
most
first
his
him
each
made
after
being
where
those
way
should
many
too
through
much
before
back
same
long
down
work
even
year
still
every
good
own
without
again
against
another
while
off
world
might
go
come
people
think
say
know
get
make
see
look
want
give
use
find
tell
ask
try
leave
call
keep
let
begin
seem
help
show
hear
play
run
move
live
believe
hold
bring
happen
must
write
provide
sit
stand
lose
pay
meet
include
continue
set
learn
change
lead
understand
watch
follow
stop
create
speak
read
allow
add
spend
grow
open
walk
win
offer
remember
love
consider
appear
buy
wait
serve
die
send
expect
build
stay
fall
cut
reach
kill
remain
suggest
raise
pass
sell
require
report
decide
pull
develop
feel
hope
receive
agree
catch
deal
draw
choose
point
happen
break
art
place
case
week
company
system
program
question
work
government
number
night
point
water
room
mother
area
money
story
fact
month
study
issue
book
eye
job
word
business
issue
side
kind
head
house
service
friend
father
power
hour
game
line
end
member
law
car
city
community
name
president
team
minute
idea
kid
body
information
back
parent
face
others
level
office
door
health
person
art
war
history
party
result
change
morning
reason
research
girl
guy
moment
air
teacher
force
education
##ing
##ion
##tion
##ed
##er
##est
##ly
##ment
##ness
##ous
##ive
##ize
##able
##ful
##less
##al
##ive
##ous
##ic
##ical
##ship
##ward
##wise
##like
##hood
##ology
##graphy
##ism
##ist
##ity
##ence
##ance
##dom
##ment
##ship
##ture
##ure
##age
##ance
##ence
##ant
##ent
##ism
##ity
##ive
##ous
##ful
##less
##able
##ible
##al
##ial
##ical
##ual
##ual
##ary
##ory
##ery
##ory
##ious
##eous
##uous
##ious
##eous
##uous
人工智能
机器学习
深度学习
神经网络
自然语言处理
计算机视觉
数据挖掘
模式识别
知识图谱
强化学习
迁移学习
生成模型
预训练
微调
嵌入
向量
语义
相似度
检索
推荐系统
问答系统
对话系统
文本分类
情感分析
命名实体
关系抽取
摘要生成
机器翻译
图像识别
目标检测
OCR
语音识别
语言模型
大模型
GPT
BERT
Transformer
注意力机制
自注意力
编码器
解码器
词向量
上下文
表示学习
特征提取
降维
聚类
分类
回归
异常检测
时间序列
序列标注
文本生成
数据增强
对抗训练
联邦学习
元学习
神经架构搜索
自动机器学习
可解释AI
公平性
隐私保护
鲁棒性
泛化能力
过拟合
欠拟合
正则化
dropout
batch normalization
激活函数
损失函数
优化器
梯度下降
反向传播
前向传播
卷积层
池化层
全连接层
残差连接
位置编码
多头注意力
前馈网络
层归一化
softmax
sigmoid
ReLU
GELU
token
vocabulary
embedding
attention
hidden state
layer norm
feed forward
multi-head
positional encoding
subword
piece
word piece
byte pair encoding
sentence piece
masking
padding
truncation
special token
fine-tuning
pre-training
transfer learning
domain adaptation
few-shot learning
zero-shot learning
prompt learning
instruction tuning
RLHF
alignment
helpfulness
honesty
harmlessness
